Zachetnaya/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_hash") VALUES (?, ?, ?, ?)  [["email", "@1.ry"], ["created_at", "2017-12-07 13:57:29.718328"], ["updated_at", "2017-12-07 13:57:29.718328"], ["password_hash", "$2a$10$kjpeg0o9dl9MJV4YEy/Aeu0dVLXBNrluL18pGAf9yGrJtXiP/V2D2"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_hash", "$2a$10$GGGsPQoOojfOmddIoeU9f.NkSJvwbTxHLr85TI1pZRNVDwOpVAtmm"], ["updated_at", "2017-12-18 21:52:15.658769"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)