lr11/app/controllers/armstrong_number_controller.rb

  	def output
  		if res = ArmstrongNumber.find_by_input_value( @number )
			@result = ActiveSupport::JSON::decode( res.output_value )
		else
			find_arm_num
			if @result[0].to_i != 0
				res = ArmstrongNumber.create :input_value => @number, :output_value => ActiveSupport::JSON::encode( @result )
---
SELECT  "armstrong_numbers".* FROM "armstrong_numbers" WHERE "armstrong_numbers"."input_value" = ? LIMIT ?  [["input_value", "3"], ["LIMIT", 1]]
INSERT INTO "armstrong_numbers" ("input_value", "output_value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["input_value", "3"], ["output_value", "[153,370,371,407]"], ["created_at", "2017-12-21 02:43:18.688806"], ["updated_at", "2017-12-21 02:43:18.688806"]]

  	def get_last
  		last = ArmstrongNumber.last
---
SELECT  "armstrong_numbers".* FROM "armstrong_numbers" WHERE (input_value = NULL) ORDER BY "armstrong_numbers"."id" DESC LIMIT ?  [["LIMIT", 1]]

  	def result_in_xml
    	@result = ArmstrongNumber.all
---
SELECT  "armstrong_numbers".* FROM "armstrong_numbers" ORDER BY "armstrong_numbers"."id" DESC LIMIT ?  [["LIMIT", 1]]