lr12/app/controllers/session_controller.rb

  def create # log in
  	user = User.find_by_username(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "1"], ["LIMIT", 1]]