lr12/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["username", "qwe"], ["created_at", "2017-12-23 07:02:33.993704"], ["updated_at", "2017-12-23 07:02:33.993704"], ["password_digest", "$2a$10$as.gh1G8s4FtVImpoRIg9e2guc/JZq8slZuHSA14h7UbhSCVS0KD6"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save